#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-69kxrthJnwTCwwsz

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.quarkus_zeebe: Refreshing state... [id=quarkus-zeebe]
github_repository.quarkus_rabbitmq_client: Refreshing state... [id=quarkus-rabbitmq-client]
github_repository.quarkus_apicurio_registry_client: Refreshing state... [id=quarkus-apicurio-registry-client]
github_repository.quarkus_tekton_client: Refreshing state... [id=quarkus-tekton-client]
github_repository.quarkus_jna: Refreshing state... [id=quarkus-jna]
github_repository.quarkus_kerberos: Refreshing state... [id=quarkus-kerberos]
github_repository.quarkus_opencv: Refreshing state... [id=quarkus-opencv]
github_repository.quarkus_xmlsec: Refreshing state... [id=quarkus-xmlsec]
github_repository.quarkus_renarde: Refreshing state... [id=quarkus-renarde]
github_repository.quarkus_morphia: Refreshing state... [id=quarkus-morphia]
github_repository.quarkus_micrometer_registry: Refreshing state... [id=quarkus-micrometer-registry]
github_repository.quarkus_vault: Refreshing state... [id=quarkus-vault]
github_repository.quarkus_qson: Refreshing state... [id=quarkus-qson]
github_repository.quarkus_openapi_generator: Refreshing state... [id=quarkus-openapi-generator]
github_repository.quarkus_microprofile: Refreshing state... [id=quarkus-microprofile]
github_repository.quarkus_lucene: Refreshing state... [id=quarkus-lucene]
github_repository.quarkus_jgrapht: Refreshing state... [id=quarkus-jgrapht]
github_repository.quarkus_scala: Refreshing state... [id=quarkus-scala3]
github_repository.quarkus_github_app: Refreshing state... [id=quarkus-github-app]
github_repository.quarkus_cucumber: Refreshing state... [id=quarkus-cucumber]
github_repository.quarkus_maven_resolver: Refreshing state... [id=quarkus-maven-resolver]
github_repository.quarkus_reactive_messaging_http: Refreshing state... [id=quarkus-reactive-messaging-http]
github_repository.quarkus_logging_splunk: Refreshing state... [id=quarkus-logging-splunk]
github_repository.quarkus_shardingsphere_jdbc: Refreshing state... [id=quarkus-shardingsphere-jdbc]
github_repository.quarkus_logging_sentry: Refreshing state... [id=quarkus-logging-sentry]
github_repository.quarkus_github_api: Refreshing state... [id=quarkus-github-api]
github_repository.quarkus_freemarker: Refreshing state... [id=quarkus-freemarker]
github_repository.quarkus_hibernate_search_extras: Refreshing state... [id=quarkus-hibernate-search-extras]
github_repository.quarkus_cxf: Refreshing state... [id=quarkus-cxf]
github_repository.quarkus_tika: Refreshing state... [id=quarkus-tika]
github_repository.quarkus_logging_manager: Refreshing state... [id=quarkus-logging-manager]
github_repository.quarkus_neo4j: Refreshing state... [id=quarkus-neo4j]
github_repository.quarkus_operator_sdk: Refreshing state... [id=quarkus-operator-sdk]
github_repository.quarkus_datadog_opentracing: Refreshing state... [id=quarkus-datadog-opentracing]
github_repository.quarkus_amazon_alexa: Refreshing state... [id=quarkus-amazon-alexa]
github_repository.quarkus_hibernate_types: Refreshing state... [id=quarkus-hibernate-types]
github_repository.quarkus_artemis: Refreshing state... [id=quarkus-artemis]
github_repository.quarkus_elasticsearch_reactive: Refreshing state... [id=quarkus-elasticsearch-reactive]
github_repository.quarkus_prettytime: Refreshing state... [id=quarkus-prettytime]
github_repository.quarkus_logging_logback: Refreshing state... [id=quarkus-logging-logback]
github_repository.quarkus_minio: Refreshing state... [id=quarkus-minio]
github_repository.quarkus_univocity_parsers: Refreshing state... [id=quarkus-univocity-parsers]
github_repository.quarkus_config_extensions: Refreshing state... [id=quarkus-config-extensions]
github_repository.quarkus_hivemq_client: Refreshing state... [id=quarkus-hivemq-client]
github_repository.quarkus_mybatis: Refreshing state... [id=quarkus-mybatis]
github_repository.quarkus_doma: Refreshing state... [id=quarkus-doma]
github_repository.quarkus_rsocket: Refreshing state... [id=quarkus-rsocket]
github_repository.quarkus_logging_cloudwatch: Refreshing state... [id=quarkus-logging-cloudwatch]
github_repository.quarkus_helm: Refreshing state... [id=quarkus-helm]
github_repository.quarkus_jgit: Refreshing state... [id=quarkus-jgit]
github_repository.quarkus_jooq: Refreshing state... [id=quarkus-jooq]
github_repository.quarkus_jackson_jq: Refreshing state... [id=quarkus-jackson-jq]
github_repository.quarkus_unleash: Refreshing state... [id=quarkus-unleash]
github_repository.quarkus_logging_json: Refreshing state... [id=quarkus-logging-json]
github_repository.quarkus_pusher_beams: Refreshing state... [id=quarkus-pusher-beams]
github_repository.quarkus_jsch: Refreshing state... [id=quarkus-jsch]
github_repository.quarkus_mockk: Refreshing state... [id=quarkus-mockk]
github_repository.quarkus_jberet: Refreshing state... [id=quarkus-jberet]
github_repository.quarkus_google_cloud_services: Refreshing state... [id=quarkus-google-cloud-services]
github_repository.quarkus_amazon_services: Refreshing state... [id=quarkus-amazon-services]
github_repository.quarkus_jjwt_jackson: Refreshing state... [id=quarkus-jjwt-jackson]
github_app_installation_repository.quarkus_rabbitmq_client["20894091"]: Refreshing state... [id=20894091:quarkus-rabbitmq-client]
github_branch.quarkus_apicurio_registry_client: Refreshing state... [id=quarkus-apicurio-registry-client:master]
github_branch.quarkus_cucumber: Refreshing state... [id=quarkus-cucumber:main]
github_repository_collaborator.quarkus_github_app["yrodiere"]: Refreshing state... [id=quarkus-github-app:yrodiere]
github_team.quarkus_cucumber: Refreshing state... [id=5020733]
github_team.quarkus_minio: Refreshing state... [id=4257600]
github_team.quarkus_github_api: Refreshing state... [id=5327486]
github_team.quarkus_prettytime: Refreshing state... [id=4612233]
github_team.quarkus_opencv: Refreshing state... [id=5330519]
github_team.quarkus_cxf: Refreshing state... [id=4221025]
github_team.quarkus_morphia: Refreshing state... [id=4994632]
github_team.quarkus_hivemq_client: Refreshing state... [id=4651319]
github_team.quarkus_apicurio_registry_client: Refreshing state... [id=4359832]
github_team.quarkus_micrometer_registry: Refreshing state... [id=4331393]
github_team.quarkus_amazon_services: Refreshing state... [id=5438747]
github_team.quarkus_github_app: Refreshing state... [id=5327479]
github_team.quarkus_shardingsphere_jdbc: Refreshing state... [id=5330628]
github_team.quarkus_hibernate_search_extras: Refreshing state... [id=5449102]
github_team.quarkus_jsch: Refreshing state... [id=5418783]
github_team.quarkus_scala: Refreshing state... [id=4973599]
github_team.quarkus_unleash: Refreshing state... [id=4478763]
github_team.quarkus_jackson_jq: Refreshing state... [id=5182252]
github_team.quarkus_zeebe: Refreshing state... [id=5333665]
github_team.quarkus_univocity_parsers: Refreshing state... [id=4707008]
github_team.quarkus_pusher_beams: Refreshing state... [id=5502715]
github_team.quarkus_openapi_generator: Refreshing state... [id=5649834]
github_team.quarkus_jgrapht: Refreshing state... [id=4691584]
github_team.quarkus_elasticsearch_reactive: Refreshing state... [id=4941463]
github_team.quarkus_jjwt_jackson: Refreshing state... [id=4698127]
github_team.quarkus_freemarker: Refreshing state... [id=4139356]
github_team.quarkus_logging_sentry: Refreshing state... [id=5300000]
github_team.quarkus_microprofile: Refreshing state... [id=5018652]
github_team.quarkus_logging_cloudwatch: Refreshing state... [id=4766806]
github_team.quarkus_qson: Refreshing state... [id=5258394]
github_team.quarkus_google_cloud_services: Refreshing state... [id=4133757]
github_team.quarkus_tika: Refreshing state... [id=5317008]
github_team.quarkus_tekton_client: Refreshing state... [id=4429729]
github_team.quarkus_vault: Refreshing state... [id=5438750]
github_team.quarkus_operator_sdk: Refreshing state... [id=4585468]
github_team.quarkus_config_extensions: Refreshing state... [id=4679791]
github_team.quarkus_logging_logback: Refreshing state... [id=4934360]
github_team.quarkus_doma: Refreshing state... [id=4206574]
github_team.quarkus_lucene: Refreshing state... [id=4572442]
github_team.quarkus_kerberos: Refreshing state... [id=5330599]
github_team.quarkus_jgit: Refreshing state... [id=5418782]
github_team.quarkus_mybatis: Refreshing state... [id=4163389]
github_team.quarkus_logging_splunk: Refreshing state... [id=4611522]
github_team.quarkus_mockk: Refreshing state... [id=4479092]
github_team.quarkus_rabbitmq_client: Refreshing state... [id=4454281]
github_team.quarkus_rsocket: Refreshing state... [id=4628116]
github_team.quarkus_jooq: Refreshing state... [id=4499064]
github_team.quarkus_hibernate_types: Refreshing state... [id=4427586]
github_team.quarkus_renarde: Refreshing state... [id=5464969]
github_team.quarkus_maven_resolver: Refreshing state... [id=5330694]
github_team.quarkus_reactive_messaging_http: Refreshing state... [id=5290863]
github_team.quarkus_artemis: Refreshing state... [id=5438742]
github_team.quarkus_amazon_alexa: Refreshing state... [id=5438751]
github_team.quarkus_xmlsec: Refreshing state... [id=5249540]
github_team.quarkus_datadog_opentracing: Refreshing state... [id=4759562]
github_team.quarkus_logging_manager: Refreshing state... [id=4193789]
github_team.quarkus_jna: Refreshing state... [id=4257639]
github_team.quarkus_helm: Refreshing state... [id=5693931]
github_team.quarkus_logging_json: Refreshing state... [id=4136031]
github_team.quarkus_jberet: Refreshing state... [id=4130738]
github_team.quarkus_neo4j: Refreshing state... [id=5438745]
github_branch.quarkus_cxf: Refreshing state... [id=quarkus-cxf:master]
github_branch.quarkus_elasticsearch_reactive: Refreshing state... [id=quarkus-elasticsearch-reactive:main]
github_branch.quarkus_config_extensions: Refreshing state... [id=quarkus-config-extensions:main]
github_branch.quarkus_jgit: Refreshing state... [id=quarkus-jgit:main]
github_branch_default.quarkus_apicurio_registry_client: Refreshing state... [id=quarkus-apicurio-registry-client]
github_branch_default.quarkus_cucumber: Refreshing state... [id=quarkus-cucumber]
github_branch.quarkus_jsch: Refreshing state... [id=quarkus-jsch:main]
github_team_repository.quarkus_cucumber: Refreshing state... [id=5020733:quarkus-cucumber]
github_repository_collaborator.quarkus_jberet["aureamunoz"]: Refreshing state... [id=quarkus-jberet:aureamunoz]
github_team_membership.quarkus_cucumber["christophd"]: Refreshing state... [id=5020733:christophd]
github_team_membership.quarkus_cucumber["stuartwdouglas"]: Refreshing state... [id=5020733:stuartwdouglas]
github_team_membership.quarkus_minio["jtama"]: Refreshing state... [id=4257600:jtama]
github_team_repository.quarkus_minio: Refreshing state... [id=4257600:quarkus-minio]
github_team_repository.quarkus_github_api: Refreshing state... [id=5327486:quarkus-github-api]
github_team_membership.quarkus_github_api["gsmet"]: Refreshing state... [id=5327486:gsmet]
github_team_membership.quarkus_prettytime["gastaldi"]: Refreshing state... [id=4612233:gastaldi]
github_team_repository.quarkus_prettytime: Refreshing state... [id=4612233:quarkus-prettytime]
github_repository_collaborator.quarkus_google_cloud_services["dzou"]: Refreshing state... [id=quarkus-google-cloud-services:dzou]
github_team_repository.quarkus_opencv: Refreshing state... [id=5330519:quarkus-opencv]
github_team_membership.quarkus_opencv["gsmet"]: Refreshing state... [id=5330519:gsmet]
github_team_repository.quarkus_cxf: Refreshing state... [id=4221025:quarkus-cxf]
github_team_membership.quarkus_cxf["dufoli"]: Refreshing state... [id=4221025:dufoli]
github_team_membership.quarkus_morphia["evanchooly"]: Refreshing state... [id=4994632:evanchooly]
github_team_membership.quarkus_cxf["shumonsharif"]: Refreshing state... [id=4221025:shumonsharif]
github_team_membership.quarkus_cxf["Dufgui"]: Refreshing state... [id=4221025:Dufgui]
github_team_repository.quarkus_morphia: Refreshing state... [id=4994632:quarkus-morphia]
github_team_repository.quarkus_hivemq_client: Refreshing state... [id=4651319:quarkus-hivemq-client]
github_team_membership.quarkus_hivemq_client["masini"]: Refreshing state... [id=4651319:masini]
github_team_membership.quarkus_apicurio_registry_client["famartinrh"]: Refreshing state... [id=4359832:famartinrh]
github_team_repository.quarkus_apicurio_registry_client: Refreshing state... [id=4359832:quarkus-apicurio-registry-client]
github_team_repository.quarkus_micrometer_registry: Refreshing state... [id=4331393:quarkus-micrometer-registry]
github_team_membership.quarkus_micrometer_registry["ebullient"]: Refreshing state... [id=4331393:ebullient]
github_team_membership.quarkus_micrometer_registry["jonatan-ivanov"]: Refreshing state... [id=4331393:jonatan-ivanov]
github_team_membership.quarkus_micrometer_registry["kenfinnigan"]: Refreshing state... [id=4331393:kenfinnigan]
github_team_repository.quarkus_amazon_services: Refreshing state... [id=5438747:quarkus-amazon-services]
github_team_membership.quarkus_amazon_services["marcinczeczko"]: Refreshing state... [id=5438747:marcinczeczko]
github_team_membership.quarkus_github_app["gsmet"]: Refreshing state... [id=5327479:gsmet]
github_team_repository.quarkus_github_app: Refreshing state... [id=5327479:quarkus-github-app]
github_team_repository.quarkus_shardingsphere_jdbc: Refreshing state... [id=5330628:quarkus-shardingsphere-jdbc]
github_team_membership.quarkus_shardingsphere_jdbc["zhfeng"]: Refreshing state... [id=5330628:zhfeng]
github_team_membership.quarkus_hibernate_search_extras["yrodiere"]: Refreshing state... [id=5449102:yrodiere]
github_team_repository.quarkus_hibernate_search_extras: Refreshing state... [id=5449102:quarkus-hibernate-search-extras]
github_team_repository.quarkus_jsch: Refreshing state... [id=5418783:quarkus-jsch]
github_team_membership.quarkus_jsch["gastaldi"]: Refreshing state... [id=5418783:gastaldi]
github_team_membership.quarkus_scala["GavinRay97"]: Refreshing state... [id=4973599:GavinRay97]
github_team_repository.quarkus_scala: Refreshing state... [id=4973599:quarkus-scala3]
github_team_membership.quarkus_unleash["andrejpetras"]: Refreshing state... [id=4478763:andrejpetras]
github_team_repository.quarkus_unleash: Refreshing state... [id=4478763:quarkus-unleash]
github_team_repository.quarkus_jackson_jq: Refreshing state... [id=5182252:quarkus-jackson-jq]
github_team_membership.quarkus_jackson_jq["aloubyansky"]: Refreshing state... [id=5182252:aloubyansky]
github_team_membership.quarkus_jackson_jq["ricardozanini"]: Refreshing state... [id=5182252:ricardozanini]
github_team_membership.quarkus_zeebe["andrejpetras"]: Refreshing state... [id=5333665:andrejpetras]
github_team_repository.quarkus_zeebe: Refreshing state... [id=5333665:quarkus-zeebe]
github_team_membership.quarkus_univocity_parsers["aruffie"]: Refreshing state... [id=4707008:aruffie]
github_team_repository.quarkus_univocity_parsers: Refreshing state... [id=4707008:quarkus-univocity-parsers]
github_team_membership.quarkus_pusher_beams["nicolas-vivot"]: Refreshing state... [id=5502715:nicolas-vivot]
github_team_membership.quarkus_openapi_generator["ricardozanini"]: Refreshing state... [id=5649834:ricardozanini]
github_team_repository.quarkus_openapi_generator: Refreshing state... [id=5649834:quarkus-openapi-generator]
github_team_repository.quarkus_pusher_beams: Refreshing state... [id=5502715:quarkus-pusher-beams]
github_team_repository.quarkus_jgrapht: Refreshing state... [id=4691584:quarkus-jgrapht]
github_team_membership.quarkus_jgrapht["rsvoboda"]: Refreshing state... [id=4691584:rsvoboda]
github_team_repository.quarkus_elasticsearch_reactive: Refreshing state... [id=4941463:quarkus-elasticsearch-reactive]
github_team_membership.quarkus_elasticsearch_reactive["loicmathieu"]: Refreshing state... [id=4941463:loicmathieu]
github_team_membership.quarkus_jjwt_jackson["gsmet"]: Refreshing state... [id=4698127:gsmet]
github_team_repository.quarkus_jjwt_jackson: Refreshing state... [id=4698127:quarkus-jjwt-jackson]
github_team_repository.quarkus_freemarker: Refreshing state... [id=4139356:quarkus-freemarker]
github_team_membership.quarkus_freemarker["vsevel"]: Refreshing state... [id=4139356:vsevel]
github_team_repository.quarkus_logging_sentry: Refreshing state... [id=5300000:quarkus-logging-sentry]
github_team_membership.quarkus_logging_sentry["gsmet"]: Refreshing state... [id=5300000:gsmet]
github_team_membership.quarkus_logging_sentry["ia3andy"]: Refreshing state... [id=5300000:ia3andy]
github_team_repository.quarkus_microprofile: Refreshing state... [id=5018652:quarkus-microprofile]
github_team_membership.quarkus_microprofile["radcortez"]: Refreshing state... [id=5018652:radcortez]
github_team_membership.quarkus_logging_cloudwatch["bennetelli"]: Refreshing state... [id=4766806:bennetelli]
github_team_membership.quarkus_logging_cloudwatch["pilhuhn"]: Refreshing state... [id=4766806:pilhuhn]
github_team_repository.quarkus_logging_cloudwatch: Refreshing state... [id=4766806:quarkus-logging-cloudwatch]
github_team_membership.quarkus_qson["patriot1burke"]: Refreshing state... [id=5258394:patriot1burke]
github_team_repository.quarkus_qson: Refreshing state... [id=5258394:quarkus-qson]
github_team_repository.quarkus_google_cloud_services: Refreshing state... [id=4133757:quarkus-google-cloud-services]
github_team_membership.quarkus_google_cloud_services["loicmathieu"]: Refreshing state... [id=4133757:loicmathieu]
github_team_repository.quarkus_tika: Refreshing state... [id=5317008:quarkus-tika]
github_team_membership.quarkus_tika["sberyozkin"]: Refreshing state... [id=5317008:sberyozkin]
github_team_repository.quarkus_tekton_client: Refreshing state... [id=4429729:quarkus-tekton-client]
github_team_membership.quarkus_tekton_client["goldmann"]: Refreshing state... [id=4429729:goldmann]
github_team_repository.quarkus_vault: Refreshing state... [id=5438750:quarkus-vault]
github_team_membership.quarkus_vault["kdubb"]: Refreshing state... [id=5438750:kdubb]
github_team_membership.quarkus_vault["sberyozkin"]: Refreshing state... [id=5438750:sberyozkin]
github_team_membership.quarkus_vault["vsevel"]: Refreshing state... [id=5438750:vsevel]
github_team_repository.quarkus_operator_sdk: Refreshing state... [id=4585468:quarkus-operator-sdk]
github_team_membership.quarkus_operator_sdk["metacosm"]: Refreshing state... [id=4585468:metacosm]
github_team_membership.quarkus_config_extensions["radcortez"]: Refreshing state... [id=4679791:radcortez]
github_team_repository.quarkus_config_extensions: Refreshing state... [id=4679791:quarkus-config-extensions]
github_team_repository.quarkus_logging_logback: Refreshing state... [id=4934360:quarkus-logging-logback]
github_team_membership.quarkus_logging_logback["stuartwdouglas"]: Refreshing state... [id=4934360:stuartwdouglas]
github_team_membership.quarkus_doma["nakamura-to"]: Refreshing state... [id=4206574:nakamura-to]
github_team_repository.quarkus_doma: Refreshing state... [id=4206574:quarkus-doma]
github_team_repository.quarkus_lucene: Refreshing state... [id=4572442:quarkus-lucene]
github_team_membership.quarkus_lucene["gustavocoding"]: Refreshing state... [id=4572442:gustavocoding]
github_team_repository.quarkus_kerberos: Refreshing state... [id=5330599:quarkus-kerberos]
github_team_membership.quarkus_kerberos["cescoffier"]: Refreshing state... [id=5330599:cescoffier]
github_team_membership.quarkus_kerberos["sberyozkin"]: Refreshing state... [id=5330599:sberyozkin]
github_team_membership.quarkus_kerberos["stuartwdouglas"]: Refreshing state... [id=5330599:stuartwdouglas]
github_team_membership.quarkus_jgit["gastaldi"]: Refreshing state... [id=5418782:gastaldi]
github_team_repository.quarkus_jgit: Refreshing state... [id=5418782:quarkus-jgit]
github_team_membership.quarkus_mybatis["zhfeng"]: Refreshing state... [id=4163389:zhfeng]
github_team_membership.quarkus_mybatis["zohar-soul"]: Refreshing state... [id=4163389:zohar-soul]
github_team_repository.quarkus_mybatis: Refreshing state... [id=4163389:quarkus-mybatis]
github_team_repository.quarkus_logging_splunk: Refreshing state... [id=4611522:quarkus-logging-splunk]
github_team_membership.quarkus_logging_splunk["rquinio1A"]: Refreshing state... [id=4611522:rquinio1A]
github_team_membership.quarkus_logging_splunk["vietk"]: Refreshing state... [id=4611522:vietk]
github_team_repository.quarkus_mockk: Refreshing state... [id=4479092:quarkus-mockk]
github_team_membership.quarkus_mockk["glefloch"]: Refreshing state... [id=4479092:glefloch]
github_team_repository.quarkus_rabbitmq_client: Refreshing state... [id=4454281:quarkus-rabbitmq-client]
github_team_membership.quarkus_rabbitmq_client["bpasson"]: Refreshing state... [id=4454281:bpasson]
github_team_membership.quarkus_rsocket["dufoli"]: Refreshing state... [id=4628116:dufoli]
github_team_repository.quarkus_rsocket: Refreshing state... [id=4628116:quarkus-rsocket]
github_team_repository.quarkus_jooq: Refreshing state... [id=4499064:quarkus-jooq]
github_team_membership.quarkus_jooq["angrymango"]: Refreshing state... [id=4499064:angrymango]
github_team_repository.quarkus_hibernate_types: Refreshing state... [id=4427586:quarkus-hibernate-types]
github_team_membership.quarkus_hibernate_types["andrejpetras"]: Refreshing state... [id=4427586:andrejpetras]
github_team_membership.quarkus_renarde["FroMage"]: Refreshing state... [id=5464969:FroMage]
github_team_repository.quarkus_renarde: Refreshing state... [id=5464969:quarkus-renarde]
github_team_membership.quarkus_maven_resolver["aloubyansky"]: Refreshing state... [id=5330694:aloubyansky]
github_team_membership.quarkus_maven_resolver["gastaldi"]: Refreshing state... [id=5330694:gastaldi]
github_team_repository.quarkus_maven_resolver: Refreshing state... [id=5330694:quarkus-maven-resolver]
github_team_membership.quarkus_reactive_messaging_http["michalszynkiewicz"]: Refreshing state... [id=5290863:michalszynkiewicz]
github_team_repository.quarkus_reactive_messaging_http: Refreshing state... [id=5290863:quarkus-reactive-messaging-http]
github_team_membership.quarkus_artemis["middagj"]: Refreshing state... [id=5438742:middagj]
github_team_repository.quarkus_artemis: Refreshing state... [id=5438742:quarkus-artemis]
github_team_repository.quarkus_amazon_alexa: Refreshing state... [id=5438751:quarkus-amazon-alexa]
github_team_membership.quarkus_amazon_alexa["oztimpower"]: Refreshing state... [id=5438751:oztimpower]
github_team_repository.quarkus_xmlsec: Refreshing state... [id=5249540:quarkus-xmlsec]
github_team_membership.quarkus_xmlsec["martinffx"]: Refreshing state... [id=5249540:martinffx]
github_team_membership.quarkus_datadog_opentracing["nicolas-vivot"]: Refreshing state... [id=4759562:nicolas-vivot]
github_team_membership.quarkus_xmlsec["gastaldi"]: Refreshing state... [id=5249540:gastaldi]
github_team_repository.quarkus_datadog_opentracing: Refreshing state... [id=4759562:quarkus-datadog-opentracing]
github_team_repository.quarkus_logging_manager: Refreshing state... [id=4193789:quarkus-logging-manager]
github_team_membership.quarkus_logging_manager["oscarfh"]: Refreshing state... [id=4193789:oscarfh]
github_team_membership.quarkus_logging_manager["phillip-kruger"]: Refreshing state... [id=4193789:phillip-kruger]
github_team_repository.quarkus_jna: Refreshing state... [id=4257639:quarkus-jna]
github_team_membership.quarkus_jna["dufoli"]: Refreshing state... [id=4257639:dufoli]
github_team_membership.quarkus_helm["Sgitario"]: Refreshing state... [id=5693931:Sgitario]
github_team_repository.quarkus_helm: Refreshing state... [id=5693931:quarkus-helm]
github_team_membership.quarkus_logging_json["SlyngDK"]: Refreshing state... [id=4136031:SlyngDK]
github_team_repository.quarkus_logging_json: Refreshing state... [id=4136031:quarkus-logging-json]
github_team_repository.quarkus_jberet: Refreshing state... [id=4130738:quarkus-jberet]
github_team_membership.quarkus_jberet["radcortez"]: Refreshing state... [id=4130738:radcortez]
github_team_membership.quarkus_neo4j["michael-simons"]: Refreshing state... [id=5438745:michael-simons]
github_team_repository.quarkus_neo4j: Refreshing state... [id=5438745:quarkus-neo4j]
github_branch_default.quarkus_cxf: Refreshing state... [id=quarkus-cxf]
github_branch_default.quarkus_elasticsearch_reactive: Refreshing state... [id=quarkus-elasticsearch-reactive]
github_branch_default.quarkus_config_extensions: Refreshing state... [id=quarkus-config-extensions]
github_branch_default.quarkus_jgit: Refreshing state... [id=quarkus-jgit]
github_branch_default.quarkus_jsch: Refreshing state... [id=quarkus-jsch]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_branch.quarkus_cxf has changed
  ~ resource "github_branch" "quarkus_cxf" {
      ~ etag          = "W/\"a57a5e139408ba26d09e660dcd5ca2122c41281a2eaf734ea65c194427b9b7c8\"" -> "W/\"0d95b6489c9ecc5d04cbb63d3969fb69a7b255b1118839ff23d2e891c23dfa8a\""
        id            = "quarkus-cxf:master"
      ~ sha           = "9f7ca3587e3c08ba019f05602ae27b83b9aefe8d" -> "a0a6b9ffa9ec2a4974c3d102cb536f4696066b36"
        # (4 unchanged attributes hidden)
    }

  # github_repository.quarkus_amazon_alexa has changed
  ~ resource "github_repository" "quarkus_amazon_alexa" {
      ~ etag                   = "W/\"bf3a7d820832a2639ed1f770d569b5e7b5aa26187ae6b6f6671a331306159b37\"" -> "W/\"ec18520a96919a18db8bb37560234d6139a49efc1ab7bf8e71abdf01cbe47a43\""
        id                     = "quarkus-amazon-alexa"
        name                   = "quarkus-amazon-alexa"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_amazon_services has changed
  ~ resource "github_repository" "quarkus_amazon_services" {
      ~ branches               = [
          ~ {
              ~ name      = "dependabot/maven/software.amazon.awssdk-bom-2.17.131" -> "dependabot/maven/software.amazon.awssdk-bom-2.17.133"
                # (1 unchanged element hidden)
            },
            {
                name      = "main"
                protected = false
            },
            # (1 unchanged element hidden)
        ]
      ~ etag                   = "W/\"8206c656190c0d4991c47948b4a5af063c7b931d7897801874ad188af96d22df\"" -> "W/\"02a624b3e9fdf09eda179e6ad5c176eb9eebf973b1b358d798e5dfb37df5b45b\""
        id                     = "quarkus-amazon-services"
        name                   = "quarkus-amazon-services"
        # (25 unchanged attributes hidden)
    }

  # github_repository.quarkus_apicurio_registry_client has changed
  ~ resource "github_repository" "quarkus_apicurio_registry_client" {
      ~ etag                   = "W/\"f3efe7db92fb5b8f9f219b1045ee893bcc0091287435db4bc167a12f94eb148e\"" -> "W/\"3d8ecc1861d5049e2b5fbaeefa7ad75aee6408b35f39aced9244aa8a0b86689b\""
        id                     = "quarkus-apicurio-registry-client"
        name                   = "quarkus-apicurio-registry-client"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_artemis has changed
  ~ resource "github_repository" "quarkus_artemis" {
      ~ etag                   = "W/\"109f039109b2d878336a98690518cf5c0ff6d52928541d65f5ebefb5af5df688\"" -> "W/\"f82a87a93d51cd1c9e75ebc45c1a3f63ff36f6f9dbe8cd371a350efd9cc919e7\""
        id                     = "quarkus-artemis"
        name                   = "quarkus-artemis"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_config_extensions has changed
  ~ resource "github_repository" "quarkus_config_extensions" {
      ~ etag                   = "W/\"94e36872338140abe48809d5c970d67ccc87fd7a140c46535e601dc079cf9799\"" -> "W/\"38b9899ad79feb673e38f6970f9a21970bbc84cc8ef42665d6601237aab743f2\""
        id                     = "quarkus-config-extensions"
        name                   = "quarkus-config-extensions"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_cucumber has changed
  ~ resource "github_repository" "quarkus_cucumber" {
      ~ etag                   = "W/\"59ef676f168711306be5a2da54074029f22653e20fc4d6e387b152a1ab96f271\"" -> "W/\"0b428f874a23b9c0814cff299fc5793817315ebbee4521af97f1203fe37d07ee\""
        id                     = "quarkus-cucumber"
        name                   = "quarkus-cucumber"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_cxf has changed
  ~ resource "github_repository" "quarkus_cxf" {
      ~ branches               = [
          ~ {
              ~ name      = "dependabot/maven/org.apache.maven.plugins-maven-compiler-plugin-3.10.0" -> "bug-fix-log-cleanup"
                # (1 unchanged element hidden)
            },
            {
                name      = "docrelease"
                protected = false
            },
            # (4 unchanged elements hidden)
            {
                name      = "issue238"
                protected = false
            },
          - {
              - name      = "issue-346-v2"
              - protected = false
            },
            {
                name      = "master"
                protected = false
            },
            # (3 unchanged elements hidden)
            {
                name      = "v0.9"
                protected = false
            },
          + {
              + name      = "ws-security-native-mode"
              + protected = false
            },
        ]
      ~ etag                   = "W/\"b2f76f1fcce6322751bc9ad7a1f3bc2c257b2de5cd837823bb83e0c5c17abef1\"" -> "W/\"653c27514cc708bf65ee07ae709adb437f340d9d4a0e4a0243d8c8d3ed7a47c1\""
        id                     = "quarkus-cxf"
        name                   = "quarkus-cxf"
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_datadog_opentracing has changed
  ~ resource "github_repository" "quarkus_datadog_opentracing" {
      ~ branches               = [
          ~ {
              ~ name      = "dependabot/maven/datadog-tracing.version-0.95.0" -> "dependabot/maven/datadog-tracing.version-0.95.1"
                # (1 unchanged element hidden)
            },
            {
                name      = "dependabot/maven/quarkus.version-2.7.1.Final"
                protected = false
            },
            # (1 unchanged element hidden)
        ]
      ~ etag                   = "W/\"1e9363de0418effc2616ef94c4f6d2549d243dfad34fabc487a902ea887ad7fa\"" -> "W/\"e34f422a555872e83bff927f51566463b4e6befb9c5773fcd7cb45d7481ef91f\""
        id                     = "quarkus-datadog-opentracing"
        name                   = "quarkus-datadog-opentracing"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_doma has changed
  ~ resource "github_repository" "quarkus_doma" {
      ~ etag                   = "W/\"c61aa6e13756579c5c090f59ac104c73649f7c653a8a11b56f54c6d9d97a6df8\"" -> "W/\"c79a0979c5adedb8005f795780705dba9d914ec3f46368b2b132775cf19a9960\""
        id                     = "quarkus-doma"
        name                   = "quarkus-doma"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_elasticsearch_reactive has changed
  ~ resource "github_repository" "quarkus_elasticsearch_reactive" {
      ~ etag                   = "W/\"778fbda6de2e8a08a143d82a0cf8abfbd3f5832c7039521202e539e2ada7b41c\"" -> "W/\"8c3d48aba001d8637fd0aa48305a0977dea3e6ba3ed2cb2046e14650aba5d80b\""
        id                     = "quarkus-elasticsearch-reactive"
        name                   = "quarkus-elasticsearch-reactive"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_freemarker has changed
  ~ resource "github_repository" "quarkus_freemarker" {
      ~ etag                   = "W/\"a35413f6706be737329836b19eb71c1585b332ae75f3decbbac48e09467501d0\"" -> "W/\"67dd433080ec314307fe164fe6296205e8e37f8cdbf36f227af0267d2c2b824e\""
        id                     = "quarkus-freemarker"
        name                   = "quarkus-freemarker"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_github_api has changed
  ~ resource "github_repository" "quarkus_github_api" {
      ~ branches               = [
            {
                name      = "dependabot/maven/org.apache.maven.plugins-maven-compiler-plugin-3.10.0"
                protected = false
            },
          - {
              - name      = "dependabot/maven/org.asciidoctor-asciidoctor-maven-plugin-2.2.2"
              - protected = false
            },
          - {
              - name      = "dependabot/maven/quarkus.version-2.7.1.Final"
              - protected = false
            },
            {
                name      = "main"
                protected = false
            },
        ]
      ~ etag                   = "W/\"bc80ef57565af811f06ee29671126e4a16032c71dfe0daade0e62ff5482ea1fd\"" -> "W/\"5a9d99d660b3f10ced53a0d96249e9b24b50ef281489496cd70f471660de876c\""
        id                     = "quarkus-github-api"
        name                   = "quarkus-github-api"
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_github_app has changed
  ~ resource "github_repository" "quarkus_github_app" {
      ~ etag                   = "W/\"78fee19ef9248ac2a4ca521cd067d7cd46c351e07fdf93cb9a4c6f1a43542aaf\"" -> "W/\"6eacb699010f7f58d98e029f23c6fb872c3c4547727a94d96319cf91c077d8fe\""
        id                     = "quarkus-github-app"
        name                   = "quarkus-github-app"
        # (28 unchanged attributes hidden)
    }

  # github_repository.quarkus_google_cloud_services has changed
  ~ resource "github_repository" "quarkus_google_cloud_services" {
      ~ branches               = [
          + {
              + name      = "all-contributors/add-lemoigne-yt"
              + protected = false
            },
            {
                name      = "dependabot/maven/org.apache.maven.plugins-maven-enforcer-plugin-3.0.0"
                protected = false
            },
            # (3 unchanged elements hidden)
        ]
      ~ etag                   = "W/\"8d5321b37097fc77542ae2de8abbfdcd75f6a0e2ad98b07d5211c3c587d442c5\"" -> "W/\"3b1780157670fdc6abc917d0f7c956b452313c83535d3721056a9520c7e90ceb\""
        id                     = "quarkus-google-cloud-services"
        name                   = "quarkus-google-cloud-services"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_hibernate_search_extras has changed
  ~ resource "github_repository" "quarkus_hibernate_search_extras" {
      ~ etag                   = "W/\"cde1a4af28b1fb7653bca2353a23b3dac7fa56b5ae2c8ba99551fb50892f163b\"" -> "W/\"728380b75aa0f5f6de61ff388030beb7e629a19774611c6e6f6a8ad38850389e\""
        id                     = "quarkus-hibernate-search-extras"
        name                   = "quarkus-hibernate-search-extras"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_hibernate_types has changed
  ~ resource "github_repository" "quarkus_hibernate_types" {
      ~ etag                   = "W/\"1d4e766df8669b1b1c6330cf3600b412ac805564e9d6233022e904fe7b75c7b0\"" -> "W/\"d573cf577b054f2174e415a545a5d5ca3615af1ef5621cbb2c5f3ebed80bd5e1\""
        id                     = "quarkus-hibernate-types"
        name                   = "quarkus-hibernate-types"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_jackson_jq has changed
  ~ resource "github_repository" "quarkus_jackson_jq" {
      ~ etag                   = "W/\"b772a782270422b62920c743b46257011f42da0084e44a23c1d0439b006c8e5a\"" -> "W/\"ff9c669839c11716c67e94cadc55537e8372d96af176380c22d48f0fd4227838\""
        id                     = "quarkus-jackson-jq"
        name                   = "quarkus-jackson-jq"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_jberet has changed
  ~ resource "github_repository" "quarkus_jberet" {
      ~ etag                   = "W/\"e831f36435ca0c83bb048c5de2effad2fc7fec57faee1fbcd34cc79d859b1938\"" -> "W/\"fb702609a7543b0d49850814dfae554422e07206921698cc4a71387ff30e4b81\""
        id                     = "quarkus-jberet"
        name                   = "quarkus-jberet"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_jgit has changed
  ~ resource "github_repository" "quarkus_jgit" {
      ~ etag                   = "W/\"7d925919933d3bf2db61a386722cb3eeb2dfbab70fda191f00c9f5b3c5b346be\"" -> "W/\"7a61505c22e9e555d98404d6f5628634c6762d3e69c506f00af1f82b4795f919\""
        id                     = "quarkus-jgit"
        name                   = "quarkus-jgit"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_jgrapht has changed
  ~ resource "github_repository" "quarkus_jgrapht" {
      ~ etag                   = "W/\"a5d1e3b6486214135437d4804bdc33029967ac49786e20eb3a8c052ee7609b02\"" -> "W/\"bd7ef0d71bfdb5b508a9d4e6cf8836049251c3d248e2dc268f1633d94e8d3514\""
        id                     = "quarkus-jgrapht"
        name                   = "quarkus-jgrapht"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_jjwt_jackson has changed
  ~ resource "github_repository" "quarkus_jjwt_jackson" {
      ~ etag                   = "W/\"ec72ae0f6b4e15ad2b71bb945058db8db808e957ac2263e392d27b7fe2055670\"" -> "W/\"d40d4bc0d7574b225c405d5f7449d93c6b3983ac9ddd4ea411ad86a290adc99d\""
        id                     = "quarkus-jjwt-jackson"
        name                   = "quarkus-jjwt-jackson"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_jsch has changed
  ~ resource "github_repository" "quarkus_jsch" {
      ~ etag                   = "W/\"64bf4e913d25e2ac9c4d268de0fb96016db0d9f1a260e4a816e5b762469a8e4c\"" -> "W/\"acf67003dedfb251774607c6e86cfeb61cc731ff3f0114580eca8432217cf65a\""
        id                     = "quarkus-jsch"
        name                   = "quarkus-jsch"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_kerberos has changed
  ~ resource "github_repository" "quarkus_kerberos" {
      ~ etag                   = "W/\"4aa38477928fa32b265d3ed671384303a33f7b535fd7d12f761f545f0e94fce5\"" -> "W/\"0f0e8705ad55bb75fd2b56a80c51f806f82c322570ed4381caa56fd267b2803d\""
        id                     = "quarkus-kerberos"
        name                   = "quarkus-kerberos"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_logging_cloudwatch has changed
  ~ resource "github_repository" "quarkus_logging_cloudwatch" {
      ~ branches               = [
            # (4 unchanged elements hidden)
            {
                name      = "dependabot/maven/com.amazonaws-aws-java-sdk-bom-1.12.66"
                protected = false
            },
          ~ {
              ~ name      = "dependabot/maven/com.amazonaws-aws-java-sdk-bom-1.12.158" -> "dependabot/maven/com.amazonaws-aws-java-sdk-bom-1.12.162"
                # (1 unchanged element hidden)
            },
            {
                name      = "dependabot/maven/quarkus.version-2.7.1.Final"
                protected = false
            },
            # (9 unchanged elements hidden)
        ]
      ~ etag                   = "W/\"8d9134b6653c234869925a80e9195ad7ea9d8f0e50d6d3539efc3dc200934cbd\"" -> "W/\"a756493f7a10665394ad38b16041dad0daa879a76b8969419ff2882d9a9540ed\""
        id                     = "quarkus-logging-cloudwatch"
        name                   = "quarkus-logging-cloudwatch"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_logging_json has changed
  ~ resource "github_repository" "quarkus_logging_json" {
      ~ etag                   = "W/\"260a1177335dc381dd52208dc22b40e977d43c5c93b63b9c1979c54e34872b53\"" -> "W/\"a9732ddf6a5c77237bc7c9afe52b85ca328fa6e38689f6ea868b603291d26c1b\""
        id                     = "quarkus-logging-json"
        name                   = "quarkus-logging-json"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_logging_manager has changed
  ~ resource "github_repository" "quarkus_logging_manager" {
      ~ etag                   = "W/\"299ee620d30ff69150ae91e46e8dc4480dc49bd0659b18c4565c3e8df1f89dd1\"" -> "W/\"595b6b6cc590e7a1074a55dba6adfd6aac5131d2b3534cfbef34c20431ef8eb6\""
        id                     = "quarkus-logging-manager"
        name                   = "quarkus-logging-manager"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_logging_sentry has changed
  ~ resource "github_repository" "quarkus_logging_sentry" {
      ~ etag                   = "W/\"4429491c14b092c644d31443cc9648a5438a7bb8ada69aa8edd7e182f7594f79\"" -> "W/\"b6acf5b665bc6a8b24656c0ff078bbe5730d8621da863747e89eceb4e9214252\""
        id                     = "quarkus-logging-sentry"
        name                   = "quarkus-logging-sentry"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_logging_splunk has changed
  ~ resource "github_repository" "quarkus_logging_splunk" {
      ~ etag                   = "W/\"13b71d2ea88149f7326d1769eb4442d6baa0a860a629978d911a5cc7d69d6f8a\"" -> "W/\"b1e106f23077671bbc815637945fd3029d7043f65fc9ade7152317357a63845e\""
        id                     = "quarkus-logging-splunk"
        name                   = "quarkus-logging-splunk"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_maven_resolver has changed
  ~ resource "github_repository" "quarkus_maven_resolver" {
      ~ etag                   = "W/\"05c8b48f174056f936ac42af25d81532d28423f59ba29556f81350ff85d39f83\"" -> "W/\"b00bfe7c8dae86f6de73c97a9c4faa7664542fb839e1d25a32a0580e22e2c826\""
        id                     = "quarkus-maven-resolver"
        name                   = "quarkus-maven-resolver"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_micrometer_registry has changed
  ~ resource "github_repository" "quarkus_micrometer_registry" {
      ~ etag                   = "W/\"d78549acc89f5fcec95f29cba595b158685c9529f0c5f8666e88f7a5e4cfadd4\"" -> "W/\"8b85146f0631386dd769bef51ae76e6fafa5de0b0ce639a86e3dbe0db9c5c583\""
        id                     = "quarkus-micrometer-registry"
        name                   = "quarkus-micrometer-registry"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_minio has changed
  ~ resource "github_repository" "quarkus_minio" {
      ~ etag                   = "W/\"605f9aa0c3cc6ec147a504397ace409eb1227dabe6391c758312e1472d759571\"" -> "W/\"bfc43a2ebff673ad62e4a4c7b205454effbc8a1196f955f41d143ab56a57abb5\""
        id                     = "quarkus-minio"
        name                   = "quarkus-minio"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_morphia has changed
  ~ resource "github_repository" "quarkus_morphia" {
      ~ etag                   = "W/\"bc096d4edad563aad76b2242c963da943edd5c9329116a4cba245e6708634744\"" -> "W/\"a8d5b24fbb5ef67a82a5b9914c9daa7100aaa89936ae1fd2a8b607e955c6fa77\""
        id                     = "quarkus-morphia"
        name                   = "quarkus-morphia"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_mybatis has changed
  ~ resource "github_repository" "quarkus_mybatis" {
      ~ etag                   = "W/\"517235fd467970d31059bdd61ba2b446da9f6bc144c514e0f6cd4ee04a10918f\"" -> "W/\"b0482a17d5604555900af5d11c2ac71478c4eb7e5c23410007a04d27a84b69b5\""
        id                     = "quarkus-mybatis"
        name                   = "quarkus-mybatis"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_neo4j has changed
  ~ resource "github_repository" "quarkus_neo4j" {
      ~ etag                   = "W/\"52d1793a5d958287dafe70077377fee7d8746b0b0512e50a42cba1c5ce69cd52\"" -> "W/\"4fbe196ac420c5dc35fab22818b48d82e87f6d295a8c69d227e5fd04d1c29965\""
        id                     = "quarkus-neo4j"
        name                   = "quarkus-neo4j"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_openapi_generator has changed
  ~ resource "github_repository" "quarkus_openapi_generator" {
      ~ etag                   = "W/\"a9e326b5d2d44b9bad5c4958bb4f5ce196bb2f5c3939ee4488f86d980db3ea7d\"" -> "W/\"eff9c83d63749c5650a344c9e75f61e716b7e2ebbb97d2cb956aa0de1be17c53\""
        id                     = "quarkus-openapi-generator"
        name                   = "quarkus-openapi-generator"
      ~ topics                 = [
          + "openapi",
          + "openapi-generator",
          + "openapi-specification",
          + "rest",
          + "rest-client",
            # (1 unchanged element hidden)
        ]
        # (25 unchanged attributes hidden)
    }

  # github_repository.quarkus_opencv has changed
  ~ resource "github_repository" "quarkus_opencv" {
      ~ etag                   = "W/\"89060a288ad6d5f1811fe62f3c554f9cc25ab80a6bbc4b9c537872f419f84ff8\"" -> "W/\"51c0c0a5e7f81d1cf0c19bd072c3877882e680ce56a1287d8ece28011936cfd8\""
        id                     = "quarkus-opencv"
        name                   = "quarkus-opencv"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_operator_sdk has changed
  ~ resource "github_repository" "quarkus_operator_sdk" {
      ~ branches               = [
            # (1 unchanged element hidden)
            {
                name      = "2.0.x"
                protected = false
            },
          + {
              + name      = "add_joke_workflow"
              + protected = false
            },
            {
                name      = "clean"
                protected = false
            },
            # (5 unchanged elements hidden)
        ]
      ~ etag                   = "W/\"d4c5c3831e95ba3846c2b95cc3933bc96f9794b5b7609e547276079f54b92165\"" -> "W/\"58ece1907a841bcc571f60c8aae00f7f38d6f1c5b04e44cef70be61ad940be28\""
        id                     = "quarkus-operator-sdk"
        name                   = "quarkus-operator-sdk"
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_prettytime has changed
  ~ resource "github_repository" "quarkus_prettytime" {
      ~ etag                   = "W/\"d8ed44793f91785628d37b39a038828553828951f80026ef228abb93a712a330\"" -> "W/\"d444fbdd740cbb45bccd94effc6311a4f365d9340643624c55799cfce6069a54\""
        id                     = "quarkus-prettytime"
        name                   = "quarkus-prettytime"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_rabbitmq_client has changed
  ~ resource "github_repository" "quarkus_rabbitmq_client" {
      ~ etag                   = "W/\"293d18d567f8a021283f8704d6075b8c53283948414bf2362a52f7e72d9fb9f2\"" -> "W/\"12887d96770af9b342ba0a4d3e3cfdc09fa77eb51c49f1074348f33b6b778dbe\""
        id                     = "quarkus-rabbitmq-client"
        name                   = "quarkus-rabbitmq-client"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_reactive_messaging_http has changed
  ~ resource "github_repository" "quarkus_reactive_messaging_http" {
      ~ etag                   = "W/\"66cab104d53bfc565b77b8b41a7c16bc7e9deb0a2fd21f754624bf4470a97d4f\"" -> "W/\"4223a3c5c85f4ceb6812dd04ddb911d37d98c4912e4f6cf1b3c80333c52449d3\""
        id                     = "quarkus-reactive-messaging-http"
        name                   = "quarkus-reactive-messaging-http"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_tekton_client has changed
  ~ resource "github_repository" "quarkus_tekton_client" {
      ~ etag                   = "W/\"8945a3ad6be9122cea8a9efb9cf58035632589df042cf3165ba0777c52bacdd0\"" -> "W/\"9f43d80687278096ac32418aae116c12191ec560afa08a4f0b5a3e0c0c36245d\""
        id                     = "quarkus-tekton-client"
        name                   = "quarkus-tekton-client"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_tika has changed
  ~ resource "github_repository" "quarkus_tika" {
      ~ etag                   = "W/\"c46293b537b9a31e0914b4ceda331d140035ea73e314afed1ec46b4e6103d8be\"" -> "W/\"998e850075ccf1b5232ed8c3bd3515f43695880c8efadc822ec352a43dda8365\""
        id                     = "quarkus-tika"
        name                   = "quarkus-tika"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_vault has changed
  ~ resource "github_repository" "quarkus_vault" {
      ~ branches               = [
            # (1 unchanged element hidden)
            {
                name      = "main"
                protected = false
            },
          + {
              + name      = "sys_mounts"
              + protected = false
            },
        ]
      ~ etag                   = "W/\"9294b0456c7ed1f508a4d02ffe6756fc41a5be20c563e11b99844f9e25456462\"" -> "W/\"fa3c1e828407605bac6051d8a94c3a99da2597f6b46ad9733401391c522bad03\""
        id                     = "quarkus-vault"
        name                   = "quarkus-vault"
        # (25 unchanged attributes hidden)
    }

  # github_repository.quarkus_zeebe has changed
  ~ resource "github_repository" "quarkus_zeebe" {
      + branches               = [
          + {
              + name      = "dependabot/maven/com.google.protobuf-protobuf-java-3.19.4"
              + protected = false
            },
          + {
              + name      = "dependabot/maven/io.camunda-zeebe-client-java-1.3.4"
              + protected = false
            },
          + {
              + name      = "main"
              + protected = false
            },
          + {
              + name      = "opentracing"
              + protected = false
            },
        ]
      ~ etag                   = "W/\"6a743d413ca03b0a456772cc3f0132a741c33105ceda6d2bed4bca002b2723c8\"" -> "W/\"91ca7303a02e53c7f15f325393b0c09c567035aca928796255b5cd9fa9be458c\""
        id                     = "quarkus-zeebe"
        name                   = "quarkus-zeebe"
        # (26 unchanged attributes hidden)
    }

  # github_team_membership.quarkus_apicurio_registry_client["famartinrh"] has been deleted
  - resource "github_team_membership" "quarkus_apicurio_registry_client" {
      - etag     = "W/\"b2cb95695d38bd323d330dd3826ab9be47b23d6b0ecb5d0c3b0b9b499a76d9f5\"" -> null
      - id       = "4359832:famartinrh" -> null
      - role     = "maintainer" -> null
      - team_id  = "4359832" -> null
      - username = "famartinrh" -> null
    }

  # github_team_repository.quarkus_amazon_alexa has changed
  ~ resource "github_team_repository" "quarkus_amazon_alexa" {
      ~ etag       = "W/\"7d338716b3266d15d0759e0171233d68924e6d85b9864ef946444abf0c60bd2b\"" -> "W/\"92edf5fcf275008ff9bc5029803aa5e425ce794d7ea610fabb833a286c7c18df\""
        id         = "5438751:quarkus-amazon-alexa"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_amazon_services has changed
  ~ resource "github_team_repository" "quarkus_amazon_services" {
      ~ etag       = "W/\"bbd4f02f8d95a75d5e63c3fc86a5ded5164872ba663a91c631d1dcec07faa9f1\"" -> "W/\"a0c0619ddba8be1f20725afe44dfd53d5b2479807771a00daa4b804a56b80ba3\""
        id         = "5438747:quarkus-amazon-services"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_apicurio_registry_client has changed
  ~ resource "github_team_repository" "quarkus_apicurio_registry_client" {
      ~ etag       = "W/\"1bc8c708c07e911c6e23c2aafc4b08de54f6ba89ff579c7f5ecbc1f8d544833a\"" -> "W/\"411c49fdf6afb83563f8c609bd579c3e736da4468c0771cfd90d8c5aa5a0942e\""
        id         = "4359832:quarkus-apicurio-registry-client"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_artemis has changed
  ~ resource "github_team_repository" "quarkus_artemis" {
      ~ etag       = "W/\"d9d795b2678f0486c836a2bbfb4a28f13f37d554b682bf135c1b92a6c6f854f5\"" -> "W/\"8b23cc90afc1b69a9ee362fc7adfdf8456f055779ad86fa7fa038d88184e88b4\""
        id         = "5438742:quarkus-artemis"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_config_extensions has changed
  ~ resource "github_team_repository" "quarkus_config_extensions" {
      ~ etag       = "W/\"f7da2dfa5ba5d06279e45566158dba4e2238bd0d8372e4d854d991aaef3ffc3c\"" -> "W/\"2cc4d0c7619843f87a8561925975f0cc9b9300cdc5b3d28c8dd83cae886325ce\""
        id         = "4679791:quarkus-config-extensions"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_cucumber has changed
  ~ resource "github_team_repository" "quarkus_cucumber" {
      ~ etag       = "W/\"23de6aa855da7ac71142a3ee855d5bbaca8257e85b1720110dc0124196c0ea2c\"" -> "W/\"ef10c7561ce8f8478c4a5f36b1461215a12c7c004c4271b5b8e907a26302093f\""
        id         = "5020733:quarkus-cucumber"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_cxf has changed
  ~ resource "github_team_repository" "quarkus_cxf" {
      ~ etag       = "W/\"952f78a4dfa57c8ce910ab9c9b196498a896d2044665ba7f9438039d7c070465\"" -> "W/\"ccdd9dcdb480243d14ebf6c28828bc399d55660bbd5ee24b5a5e59713c1b5120\""
        id         = "4221025:quarkus-cxf"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_datadog_opentracing has changed
  ~ resource "github_team_repository" "quarkus_datadog_opentracing" {
      ~ etag       = "W/\"6db93643e655cfc10928e4e0af2f66c627b52ce671c6ef81609c967f9343087a\"" -> "W/\"89a568eda76cea7562555026f6937dbd3fa72ca0f7e0ea0e90c3ca87b0979dbf\""
        id         = "4759562:quarkus-datadog-opentracing"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_doma has changed
  ~ resource "github_team_repository" "quarkus_doma" {
      ~ etag       = "W/\"e56b736910eb6dd1f9bea35a5135077ffa2f1adb61736383ae565f789602fc26\"" -> "W/\"20eeaf9740bb67bbb88a3868ad44bfd4b4be70ea87c08fb00d8291841c864df5\""
        id         = "4206574:quarkus-doma"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_elasticsearch_reactive has changed
  ~ resource "github_team_repository" "quarkus_elasticsearch_reactive" {
      ~ etag       = "W/\"06321b1a1f8f83ad9eec6dde58e5cd6ad23a616a5d3877eabf8a31f9686d0ffe\"" -> "W/\"35041aef7cc0666b5bab6374387b63c30fd4bf4762d938ebdc6580c27da36605\""
        id         = "4941463:quarkus-elasticsearch-reactive"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_freemarker has changed
  ~ resource "github_team_repository" "quarkus_freemarker" {
      ~ etag       = "W/\"fea402859139a141af428bab7397bf28f8df9a4321544c95d21250227334c654\"" -> "W/\"ec283cb3911896f142de111ba3bec143349bc05d7388018ca16ed20248388df0\""
        id         = "4139356:quarkus-freemarker"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_github_api has changed
  ~ resource "github_team_repository" "quarkus_github_api" {
      ~ etag       = "W/\"a3d3682b80ce697ca02a79290ab4f0e396e9b2290f35cc747b60effb8a9305a5\"" -> "W/\"8e8dea6e355bbd4f4d5021e7e62329f7ae396c4131e1c30163816b0c1254880a\""
        id         = "5327486:quarkus-github-api"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_github_app has changed
  ~ resource "github_team_repository" "quarkus_github_app" {
      ~ etag       = "W/\"12f1812963e5fcde69f45efc21a1e380ea87e6d729532e520f415dad6f7cd524\"" -> "W/\"c61fd6dd10e986e899c768d7523b69aae6adfb61ed51cf331c1f8361064e4226\""
        id         = "5327479:quarkus-github-app"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_google_cloud_services has changed
  ~ resource "github_team_repository" "quarkus_google_cloud_services" {
      ~ etag       = "W/\"5af0e46dbba133100f0169d20baa5fa8ee4844c50ca9f352126d5b84bf80e5f1\"" -> "W/\"3eca640c5bb43b95bfc183ff23d2fbf080b9f4931f2c602ed4528699a7e97cd5\""
        id         = "4133757:quarkus-google-cloud-services"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_hibernate_search_extras has changed
  ~ resource "github_team_repository" "quarkus_hibernate_search_extras" {
      ~ etag       = "W/\"5b5f52420df7223f24a83deaf8c7ef4c7033ae096b715013be888484627a9ad1\"" -> "W/\"81037cb4ccff032a486cef894084ae9252943c2bc3f43859bac957efa285d58a\""
        id         = "5449102:quarkus-hibernate-search-extras"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_hibernate_types has changed
  ~ resource "github_team_repository" "quarkus_hibernate_types" {
      ~ etag       = "W/\"65dc353c326986ad36584ec6a38b720f3be352e128da6b15b0724b167f56f5eb\"" -> "W/\"59954c0e355e207fd167ac4a6da7fb31976cdfcd8b8353bc505f1723fb6c7108\""
        id         = "4427586:quarkus-hibernate-types"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_jackson_jq has changed
  ~ resource "github_team_repository" "quarkus_jackson_jq" {
      ~ etag       = "W/\"2664ca0e7d0c20d7fdd7e5defca213336d87e7a2ff6f8db5c3e26d1aa4866945\"" -> "W/\"c07d4c49075ca0f1d2aaa6cafafd473a57ca7534774bc54433dba36a9aa7cf91\""
        id         = "5182252:quarkus-jackson-jq"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_jberet has changed
  ~ resource "github_team_repository" "quarkus_jberet" {
      ~ etag       = "W/\"5bfaf170e2d4f052e9c0df50223fa4256ec726d3ddb27e8c8759e6eb6931a155\"" -> "W/\"d34282130a2675f60c29c72556d9a7c8967fe1b974f4fadb05b65d797269c023\""
        id         = "4130738:quarkus-jberet"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_jgit has changed
  ~ resource "github_team_repository" "quarkus_jgit" {
      ~ etag       = "W/\"f5e3e90e2c9388b5691f4805b3b4769903c9394faa0423eaeb2f5f2844c8adce\"" -> "W/\"82cb826c14056f97d35ecb3d70ab9f971258a4cde96f8d787311fa0d201ce00f\""
        id         = "5418782:quarkus-jgit"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_jgrapht has changed
  ~ resource "github_team_repository" "quarkus_jgrapht" {
      ~ etag       = "W/\"d840d860e46a035ebfbfd71e39fe54f7491961166a80f4b6377e8d236f89a91b\"" -> "W/\"67b0a436c3e9f747c5e5817432d26243068e2f93bd3a381c6017d8159c7af486\""
        id         = "4691584:quarkus-jgrapht"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_jjwt_jackson has changed
  ~ resource "github_team_repository" "quarkus_jjwt_jackson" {
      ~ etag       = "W/\"b8a95984999f8d07b917f3b92b11b41c1e92e5461fdcfd4affa5984d7d3f30e7\"" -> "W/\"5428ba5fdc3754b1e7ab02b00398d8469d197c9762245285e93635cd851f7d67\""
        id         = "4698127:quarkus-jjwt-jackson"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_jsch has changed
  ~ resource "github_team_repository" "quarkus_jsch" {
      ~ etag       = "W/\"1eda5433ee0a8ce8f5b99f7c513c0f5f3aac97bddc6e9e2de7eed4938992346d\"" -> "W/\"3c58f5ed59291842e1cd5238db400bd4f4fae739f5d6e3605d98e9dd51a616e6\""
        id         = "5418783:quarkus-jsch"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_kerberos has changed
  ~ resource "github_team_repository" "quarkus_kerberos" {
      ~ etag       = "W/\"3193ae286af8bcd32fcb6fd8edc4c776fa12a88e2e0e05d780353d31d567ca7d\"" -> "W/\"e1661841f3f8825e67c343963364d1eddc9f9e3785ad96f51977333ae8d7b770\""
        id         = "5330599:quarkus-kerberos"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_logging_cloudwatch has changed
  ~ resource "github_team_repository" "quarkus_logging_cloudwatch" {
      ~ etag       = "W/\"0131abf16924fa32a743d5c246ec815b78d41174b38c673c875e198cf47c6fc0\"" -> "W/\"dde413eee29ee62407f2c6c7cc656bcf27a211c35930a4f02c03e0934c86d980\""
        id         = "4766806:quarkus-logging-cloudwatch"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_logging_json has changed
  ~ resource "github_team_repository" "quarkus_logging_json" {
      ~ etag       = "W/\"46668fbc6aa8225e0d3a94c903587cc850cc1c909d0cce1248f296f58bacf736\"" -> "W/\"b2a38fd858ec58410045ed483af767ea4149c044988ffd52a182a688073894cf\""
        id         = "4136031:quarkus-logging-json"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_logging_logback has changed
  ~ resource "github_team_repository" "quarkus_logging_logback" {
      ~ etag       = "W/\"2dfe8710f5e7edf25cb03a1a97aa3b110818a3710bee0c22f03d520f13ca56e4\"" -> "W/\"3920725a6fdf47526a6b3c2ebabb8114db950745273bb52b4776f84431cdd332\""
        id         = "4934360:quarkus-logging-logback"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_logging_manager has changed
  ~ resource "github_team_repository" "quarkus_logging_manager" {
      ~ etag       = "W/\"2d73dc3f8130fbc42c25c23eaaebb26ec6b2f6535c856c565cc7e8cbd77b4f72\"" -> "W/\"196ee3ff03f45cefd052a50a88d0006913a1b711f1dd499a6d6893cbd1deef56\""
        id         = "4193789:quarkus-logging-manager"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_logging_sentry has changed
  ~ resource "github_team_repository" "quarkus_logging_sentry" {
      ~ etag       = "W/\"244672841eaa36f6b4c8305e4ce677e3a78d9cc928a91ba823346288101a2691\"" -> "W/\"5c8cba9437de825a938c5f045b6401ddf9971eaa453f47adc81e3964499461a5\""
        id         = "5300000:quarkus-logging-sentry"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_logging_splunk has changed
  ~ resource "github_team_repository" "quarkus_logging_splunk" {
      ~ etag       = "W/\"57047328024b5160f8a2dbec03c3b6da50a200b1de4417eebe0240082f3ce988\"" -> "W/\"facb9655e40f69f1ac51f793a52f53eaae02d00b7848264b03b518e756c42386\""
        id         = "4611522:quarkus-logging-splunk"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_maven_resolver has changed
  ~ resource "github_team_repository" "quarkus_maven_resolver" {
      ~ etag       = "W/\"ed7ff01294274f0ec0d62b9a3af7564fb3ee1ce879ba71fd9ecd5ca25132ea87\"" -> "W/\"2d11f52b237b2815e865915db80fddfd472f27a2369f95ac2f8f33dba9fdad39\""
        id         = "5330694:quarkus-maven-resolver"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_micrometer_registry has changed
  ~ resource "github_team_repository" "quarkus_micrometer_registry" {
      ~ etag       = "W/\"84d6969bf399a37a8406a660ea33eb8e94444ed1fd3da9ac2fc721532337f23a\"" -> "W/\"e2cd7ba68772ae341fbcf40374fa752a16c25948a1cdbb2a60888ebf4d04498f\""
        id         = "4331393:quarkus-micrometer-registry"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_minio has changed
  ~ resource "github_team_repository" "quarkus_minio" {
      ~ etag       = "W/\"b616ec5be4bd6685a329acc0ecab03e2d7c875dc055e0ea325161c40efc9d431\"" -> "W/\"ef4eb44e367d570bfed651dcff179a55c4107d904c6924d5ac03bbbf15a96b5d\""
        id         = "4257600:quarkus-minio"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_morphia has changed
  ~ resource "github_team_repository" "quarkus_morphia" {
      ~ etag       = "W/\"0dc2ff9954dba268aafe1f9826d43855d8d977318fa48f1748f7501eb63f2944\"" -> "W/\"bf75d80a5428fb48d810c35cad9f004b29553d542ba3786a4f98aed4457dd962\""
        id         = "4994632:quarkus-morphia"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_mybatis has changed
  ~ resource "github_team_repository" "quarkus_mybatis" {
      ~ etag       = "W/\"9240da7661ec375fc15f950c64bd841cf4a5ab51f5bcfff750139005d14e9fef\"" -> "W/\"2c9563edcc206d3c5b3d08a109110b64d1660d2f3de8a9a3c25edaed8e63b5a6\""
        id         = "4163389:quarkus-mybatis"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_neo4j has changed
  ~ resource "github_team_repository" "quarkus_neo4j" {
      ~ etag       = "W/\"ce44880c8bfc54353f3c377385b65f0cf338163d1d6e88f6afc1ce54ac36573b\"" -> "W/\"667ce8061d036ec0738198288fda95ff0d95afc5c3506a988fb944c364898878\""
        id         = "5438745:quarkus-neo4j"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_openapi_generator has changed
  ~ resource "github_team_repository" "quarkus_openapi_generator" {
      ~ etag       = "W/\"d7916f40e20319a1f91346aefff630309528668d9145b8afdfd18234b9323c60\"" -> "W/\"de66c21abf14873b5bc1cfeb6c570038fed4d46f3eeec860f71b2e6b3ca23f58\""
        id         = "5649834:quarkus-openapi-generator"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_opencv has changed
  ~ resource "github_team_repository" "quarkus_opencv" {
      ~ etag       = "W/\"9a4a3b835717f880b873590e1d163c93dc3beadf86cc1fe5f2f6b4dd3ca2b6c7\"" -> "W/\"bee1f90af0ace3c51393889e0a8cfc00981caf59b738718a083a7b7ef754bdbb\""
        id         = "5330519:quarkus-opencv"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_operator_sdk has changed
  ~ resource "github_team_repository" "quarkus_operator_sdk" {
      ~ etag       = "W/\"a4fb477262a35c2e6cfe79e325d786c947acbe1b6738f933fbde5b2148429286\"" -> "W/\"b707728476824f36f960affae96be0961776de0c97168e36a617046160ea5e44\""
        id         = "4585468:quarkus-operator-sdk"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_prettytime has changed
  ~ resource "github_team_repository" "quarkus_prettytime" {
      ~ etag       = "W/\"45fe32498355bca6afa67f7bb000a83f928a6aa4d3d2136cc2d1b6e9cde3666a\"" -> "W/\"09a9723a71d0b4928bb9ea729dd107caa00f04afe54242f0a027878a759e4fcd\""
        id         = "4612233:quarkus-prettytime"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_rabbitmq_client has changed
  ~ resource "github_team_repository" "quarkus_rabbitmq_client" {
      ~ etag       = "W/\"e134271285295cad29732843bac77c9ed330f74b14213931e20410c083cf4784\"" -> "W/\"58e77f71c3e8b44304853e07e11ae987a11a34233ffc7161b6b6fd1bb4009d56\""
        id         = "4454281:quarkus-rabbitmq-client"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_reactive_messaging_http has changed
  ~ resource "github_team_repository" "quarkus_reactive_messaging_http" {
      ~ etag       = "W/\"bfd323c161f09b14ee5e835216f19e4162e0aaeac3ba223ebd2523c6c2a71276\"" -> "W/\"613f958b95acb9ae8fd52e542ba9ccb4c095b699ffd44882e30dca6871f22fae\""
        id         = "5290863:quarkus-reactive-messaging-http"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_tekton_client has changed
  ~ resource "github_team_repository" "quarkus_tekton_client" {
      ~ etag       = "W/\"f1744bda7654da5b96dc6d24cb3fb6eeeb6ed8602217761e812c674c072c9f31\"" -> "W/\"e407b16a67136c2a9c47a5d2d4937467679fbd4852d41d43e67f20fb236c1ee8\""
        id         = "4429729:quarkus-tekton-client"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_tika has changed
  ~ resource "github_team_repository" "quarkus_tika" {
      ~ etag       = "W/\"9da8efe34a855d1c0aa6dd44e4873ad06a47d68a51cce06354b9b742ffb3414f\"" -> "W/\"971b7e36083b7d8fca4925f03552f130dda255835188a17205b4e4b1eb6b083b\""
        id         = "5317008:quarkus-tika"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_vault has changed
  ~ resource "github_team_repository" "quarkus_vault" {
      ~ etag       = "W/\"6ce03d95c68dfc5bbe3ff26ca1b66235c60ce653fceebaa2615274dca1eca0ef\"" -> "W/\"16e6e685d701011d5d52b15bfc0f1c764536f2ba5bb49b7a27cd969b00c58af7\""
        id         = "5438750:quarkus-vault"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_zeebe has changed
  ~ resource "github_team_repository" "quarkus_zeebe" {
      ~ etag       = "W/\"0a89ebd4ea0259ebbc3392225ec13514df11069c83f8a37c339fb4d5b4659397\"" -> "W/\"187346dbfb0166c67c0a56251155bedf957f75645f0291e6dfe2724b0d58d3da\""
        id         = "5333665:quarkus-zeebe"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.quarkus_file_vault will be created
  + resource "github_repository" "quarkus_file_vault" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "A cool description"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "quarkus-file-vault"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "quarkus-extension",
        ]
      + visibility             = (known after apply)
      + vulnerability_alerts   = true
    }

  # github_repository.quarkus_openapi_generator will be updated in-place
  ~ resource "github_repository" "quarkus_openapi_generator" {
        id                     = "quarkus-openapi-generator"
        name                   = "quarkus-openapi-generator"
      ~ topics                 = [
          - "openapi",
          - "openapi-generator",
          - "openapi-specification",
          - "rest",
          - "rest-client",
            # (1 unchanged element hidden)
        ]
        # (26 unchanged attributes hidden)
    }

  # github_team.quarkus_file_vault will be created
  + resource "github_team" "quarkus_file_vault" {
      + create_default_maintainer = false
      + description               = "Quarkiverse file-vault team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-file-vault"
      + node_id                   = (known after apply)
      + parent_team_id            = 5344029
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.quarkus_apicurio_registry_client["famartinrh"] will be created
  + resource "github_team_membership" "quarkus_apicurio_registry_client" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "4359832"
      + username = "famartinrh"
    }

  # github_team_membership.quarkus_file_vault["cescoffier"] will be created
  + resource "github_team_membership" "quarkus_file_vault" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "cescoffier"
    }

  # github_team_membership.quarkus_file_vault["sberyozkin"] will be created
  + resource "github_team_membership" "quarkus_file_vault" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "sberyozkin"
    }

  # github_team_membership.quarkus_file_vault["stuartwdouglas"] will be created
  + resource "github_team_membership" "quarkus_file_vault" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "stuartwdouglas"
    }

  # github_team_repository.quarkus_file_vault will be created
  + resource "github_team_repository" "quarkus_file_vault" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-file-vault"
      + team_id    = (known after apply)
    }

Plan: 7 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @gastaldi, Action: `pull_request`*